#include <stdio.h>
#include <stdlib.h>

int main(int argc, char * argv[])
{
    printf("1 %06.3f\n",1.234);
    printf("2 %06.3f\n",1.2341);
    printf("3 %06.3f\n",1.2345);
    printf("4 %06.3f\n",1.2346);
    printf("5 %06.3f\n",1.2349);

    printf("6 %06.3f\n",1.2335);
    printf("7 %06.3f\n",1.2345);


}

/* 运行结果：
schumipush@T560:/mnt.../C_Funct_Test$ ./a.out
01.234
01.234
01.234
01.235
01.235
*/

// 说明 printf() 在根据小数精度进行截短时，进行的是 “四舍六入五留双”
/* 参考：https://zh.wikipedia.org/wiki/%E5%A5%87%E9%80%B2%E5%81%B6%E6%8D%A8

其具体要求举例如下（以保留两位小数为例）：
保留位数的后一位如果小于5，则舍去。例如5.214保留两位小数为5.21。
保留位数的后一位如果大于5，则进上去。例如5.216保留两位小数为5.22。
保留位数的后一位如果是5，而且5后面仍有数。例如5.2254保留两位小数为5.23，也就是说如果5后面还有数据，则无论奇偶都要进入。
保留位数的后一位如果是5，而且5后面不再有数，要根据应看尾数“5”的前一位决定是舍去还是进入: 如果是奇数则进入，如果是偶数则舍去。例如5.215保留两位小数为5.22； 5.225保留两位小数为5.22。
按照四舍六入五成双规则进行数字修约时，也应像四舍五入规则那样，一次性修约到指定的位数，不可以进行数次修约，否则得到的结果也有可能是错误的。

参考：https://blog.csdn.net/abcdu1/article/details/75090369（该博客的评论中有人指出了 “奇进偶舍”）
*/